[M_Sage_AcquiredTaste MissionDefinition]
TurnInDescription="The only good flesh-eating borok is a dead flesh-eating borok. Or a really rare one named ''Devin''. He's cool."

[M_Sage_AcquiredTaste:LureCreatureSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hammerlock has tracked down a borok with a taste for human flesh. He wants you to lure it out then get rid of it, obviously.<br><br>You have two options for luring out the borok: either lead a savage into the borok's lair, or injure yourself so badly that you fall into Fight For Your Life mode. One of these methods is safe. The other is awesome."
